import 'package:flutter/material.dart';
import '../AzkarContainer.dart';
import '../CustomAppBar.dart';
import '../CustomDrawer.dart';

class AzkarB3dElSalah extends StatelessWidget {
  List<Map<String, Object>> azkary = [
    {
      'zekr':
          '  أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله اللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرامأَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله.اللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام',
      'counter': 1,
      'initial': 1,
      'title': '',
      'fadl': '',
    },
    {
      'zekr':
          'لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْد، وهوَ على كلّ شَيءٍ قَدير، اللّهُـمَّ لا مانِعَ لِما أَعْطَـيْت، وَلا مُعْطِـيَ لِما مَنَـعْت، وَلا يَنْفَـعُ ذا الجَـدِّ مِنْـكَ الجَـد. ',
      'counter': 1,
      'initial': 1,
      'title': '',
      'fadl': '',
    },
    {
      'zekr':
          'لا إلهَ إلاّ اللّه, وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمد، وهوَ على كلّ شيءٍ قدير، لا حَـوْلَ وَلا قـوَّةَ إِلاّ بِاللهِ، لا إلهَ إلاّ اللّـه، وَلا نَعْـبُـدُ إِلاّ إيّـاه, لَهُ النِّعْـمَةُ وَلَهُ الفَضْل وَلَهُ الثَّـناءُ الحَـسَن، لا إلهَ إلاّ اللّهُ مخْلِصـينَ لَـهُ الدِّينَ وَلَوْ كَـرِهَ الكـافِرون.',
      'counter': 1,
      'initial': 1,
      'title': '',
      'fadl': '',
    },
    {
      'zekr': 'سُـبْحانَ اللهِ . ',
      'counter': 33,
      'initial': 33,
      'title': '',
      'fadl': '',
    },
    {
      'zekr': 'الحَمْـدُ لله.',
      'counter': 33,
      'initial': 33,
      'title': '',
      'fadl': '',
    },
    {
      'zekr': 'اللهُ أكْـبَر. ',
      'counter': 33,
      'initial': 33,
      'title': '',
      'fadl': '',
    },
    {
      'zekr':
          ' لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَـدير. ',
      'counter': 1,
      'initial': 1,
      'title': '',
      'fadl': '',
    },
    {
      'zekr':
          'قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ. ',
      'counter': 3,
      'initial': 3,
      'title': 'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ ',
      'fadl': 'ثلاث مرات بعد صلاتي الفجر والمغرب. ومرة بعد الصلوات الأخرى.'
    },
    {
      'zekr':
          'قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ. ',
      'counter': 3,
      'initial': 3,
      'title': 'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ ',
      'fadl': 'ثلاث مرات بعد صلاتي الفجر والمغرب. ومرة بعد الصلوات الأخرى.'
    },
    {
      'zekr':
          'قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.',
      'counter': 3,
      'initial': 3,
      'title': 'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ ',
      'fadl': 'ثلاث مرات بعد صلاتي الفجر والمغرب. ومرة بعد الصلوات الأخرى.'
    },
    {
      'zekr':
          'لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير.',
      'counter': 10,
      'initial': 10,
      'title': 'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ ',
      'fadl': 'عَشْر مَرّات بَعْدَ المَغْرِب وَالصّـبْح و مره واحده عدا ذلك.',
    },
    {
      'zekr':
          'اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِلْمـاً نافِعـاً وَرِزْقـاً طَيِّـباً ، وَعَمَـلاً مُتَقَـبَّلاً. .',
      'counter': 1,
      'initial': 1,
      'title': '',
      'fadl': 'بَعْد السّلامِ من صَلاةِ الفَجْر.',
    },
    {
      'zekr':
          'اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ .',
      'counter': 1,
      'initial': 1,
      'title': 'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ ',
      'fadl': '',
    },
    {
      'zekr': 'اللَّهُمَّ أَجِرْنِي مِنْ النَّار. ',
      'counter': 7,
      'initial': 7,
      'title': '',
      'fadl': 'بعد صلاة الصبح والمغرب.',
    },
    {
      'zekr':
          'اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ.',
      'counter': 1,
      'initial': 1,
      'title': '',
      'fadl': '',
    },
  ];

  final darkModeSetter;
  final langSetter;

  AzkarB3dElSalah({required this.langSetter, required this.darkModeSetter});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: CustomAppBar(),
      drawer: CustomDrawer(
        setLang: langSetter,
        setMode: darkModeSetter,
      ),
      body: AzkarContainer(
        azkary: azkary,
      ),
    );
  }
}
