import 'package:azkark/Widgets/AzkarContainer.dart';
import 'package:flutter/material.dart';

class tasabeeh extends StatelessWidget {
  List<Map> azkary = [
    {
      'zekr': '''
سُبْحَانَ اللَّهِ 
''',
      'counter': 100,
      'initial': 100,
      'fadl': 'يكتب له ألف حسنة أو يحط عنه ألف خطيئة.',
      'title': '',
    },
    {
      'zekr': '''
سُبْحَانَ اللَّهِ وَبِحَمْدِهِ 
''',
      'counter': 100,
      'initial': 100,
      'fadl':
          'حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.',
      'title': '',
    },
    {
      'zekr': '''
سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ
''',
      'counter': 100,
      'initial': 100,
      'fadl': 'تَمْلَآَنِ مَا بَيْنَ السَّمَاوَاتِ وَالْأَرْضِ.',
      'title': '',
    },
    {
      'zekr': '''
سُبْحَانَ اللهِ العَظِيمِ وَبِحَمْدِهِ
''',
      'counter': 100,
      'initial': 100,
      'fadl': 'غرست له نخلة في الجنة (أى عدد).',
      'title': '',
    },
    {
      'zekr': '''
سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ، سُبْحَانَ اللَّهِ الْعَظِيمِ
''',
      'counter': 100,
      'initial': 100,
      'fadl': 'ثقيلتان في الميزان حبيبتان إلى الرحمن (أى عدد).',
      'title': '',
    },
    {
      'zekr': '''
لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلُّ شَيْءِ قَدِيرِ. 
''',
      'counter': 100,
      'initial': 100,
      'fadl':
          'كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.',
      'title': '',
    },
    {
      'zekr': '''
الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ
''',
      'counter': 100,
      'initial': 100,
      'fadl': 'تملأ ميزان العبد بالحسنات.',
      'title': '',
    },
    {
      'zekr': '''
لا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ
''',
      'counter': 100,
      'initial': 100,
      'fadl': 'كنز من كنوز الجنة (أى عدد).',
      'title': '',
    },
    {
      'zekr': '''
الْلَّهُم صَلِّ وَسَلِم وَبَارِك عَلَى سَيِّدِنَا مُحَمَّد
''',
      'counter': 100,
      'initial': 100,
      'fadl': 'من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.',
      'title': '',
    },
    {
      'zekr': '''
أستغفر الله
''',
      'counter': 100,
      'initial': 100,
      'fadl': 'لفعل الرسول صلى الله عليه وسلم.',
      'title': '',
    },
    {
      'zekr': '''
سُبْحَانَ الْلَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا الْلَّهُ، وَالْلَّهُ أَكْبَرُ
''',
      'counter': 100,
      'initial': 100,
      'fadl':
          'أنهن أحب الكلام الى الله، ومكفرات للذنوب، وغرس الجنة، وجنة لقائلهن من النار، وأحب الى النبي عليه السلام مما طلعت عليه الشمس، والْبَاقِيَاتُ الْصَّالِحَات.',
      'title': '',
    },
    {
      'zekr': '''
لَا إِلَهَ إِلَّا اللَّهُ
''',
      'counter': 100,
      'initial': 100,
      'fadl': 'أفضل الذكر لا إله إلاّ الله.',
      'title': '',
    },
    {
      'zekr': '''
الْلَّهُ أَكْبَرُ
''',
      'counter': 100,
      'initial': 100,
      'fadl':
          'من قال الله أكبر كتبت له عشرون حسنة وحطت عنه عشرون سيئة. الله أكبر من كل شيء.',
      'title': '',
    },
    {
      'zekr': '''
سُبْحَانَ اللَّهِ ، وَالْحَمْدُ لِلَّهِ ، وَلا إِلَهَ إِلا اللَّهُ ، وَاللَّهُ أَكْبَرُ ، اللَّهُمَّ اغْفِرْ لِي ، اللَّهُمَّ ارْحَمْنِي ، اللَّهُمَّ ارْزُقْنِي.
''',
      'counter': 100,
      'initial': 100,
      'fadl': 'خير الدنيا والآخرة',
      'title': '',
    },
    {
      'zekr': '''
الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ.
''',
      'counter': 100,
      'initial': 100,
      'fadl':
          'قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏"‏لَقَدْ رَأَيْتُ اثْنَيْ عَشَرَ مَلَكًا يَبْتَدِرُونَهَا، أَيُّهُمْ يَرْفَعُهَا"‏.',
      'title': '',
    },
    {
      'zekr': '''
اللَّهُ أَكْبَرُ كَبِيرًا ، وَالْحَمْدُ لِلَّهِ كَثِيرًا ، وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلاً.
''',
      'counter': 100,
      'initial': 100,
      'fadl':
          'قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ "عَجِبْتُ لَهَا ، فُتِحَتْ لَهَا أَبْوَابُ السَّمَاءِ".',
      'title': '',
    },
    {
      'zekr': '''
اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ , وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ , اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ.
''',
      'counter': 100,
      'initial': 100,
      'fadl':
          'في كل مره تحط عنه عشر خطايا ويرفع له عشر درجات ويصلي الله عليه عشرا وتعرض على الرسول صلى الله عليه وسلم (أى عدد).',
      'title': '',
    },
  ];

  @override
  Widget build(BuildContext context) {
    return Container(
      child: AzkarContainer(azkary: azkary),
    );
  }
}
